Revit 2027 API
Application.ShowGraphicalWarningCableTrayConduitDisconnects Property
 Whether or not to show the graphical warnings for CTC disconnects.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGraphicalWarningCableTrayConduitDisconnects { get; set; }
Public Property ShowGraphicalWarningCableTrayConduitDisconnects As Boolean
	Get
	Set
public:
property bool ShowGraphicalWarningCableTrayConduitDisconnects {
	bool get ();
	void set (bool value);
}
member ShowGraphicalWarningCableTrayConduitDisconnects : bool with get, set
Property Value
Boolean
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace